In [28]:
import pandas as pd
import numpy as np

In [23]:
data = {
    'Roll numbers': [1,2,3,4,5,6,7,8,9,10],
    'Name': ['Shweta','Roha','Naina','Vansh','Puja','Aniket','Manik','Pranay','Pihu','Anirudh'],
    'Gender': ['F','F','F','M','F','M','M','M','F','M'],
    'Marks1': [91,98,78,65,45,27,89,92,72,86],
    'Marks2': [87,35,74,68,64,80,59,93,38,37],
    'Marks3': [94,77,60,58,62,54,82,64,72,91]
}
df = pd.DataFrame(data)
print(df)

   Roll numbers     Name Gender  Marks1  Marks2  Marks3
0             1   Shweta      F      91      87      94
1             2     Roha      F      98      35      77
2             3    Naina      F      78      74      60
3             4    Vansh      M      65      68      58
4             5     Puja      F      45      64      62
5             6   Aniket      M      27      80      54
6             7    Manik      M      89      59      82
7             8   Pranay      M      92      93      64
8             9     Pihu      F      72      38      72
9            10  Anirudh      M      86      37      91

In [20]:
df['Total'] = df.iloc[:,3:6].sum(axis=1)
df

   Roll numbers     Name Gender  Marks1  Marks2  Marks3  Total
0             1   Shweta      F      91      87      94    272
1             2     Roha      F      98      55      77    230
2             3    Naina      F      78      74      60    212
3             4    Vansh      M      65      68      58    191
4             5     Puja      F      45      34      62    141
5             6   Aniket      M      27      80      54    161
6             7    Manik      M      89      59      82    230
7             8   Pranay      M      92      93      64    249
8             9     Pihu      F      72      88      72    232
9            10  Anirudh      M      86      37      91    214

In [6]:
low_marks1 = df['Marks1'].min()
print(f"lowest in marks 1 is {low_marks1}")

lowest in marks 1 is 45

In [7]:
high_marks2 = df['Marks2'].max()
print(f"highest in marks 2 is {high_marks2}")

highest in marks 2 is 94

In [8]:
mean_marks3 = df['Marks3'].mean()
print(f"mean of marks 3 is {mean_marks3}")

mean of marks 3 is 71.4

In [9]:
df['Average'] = df.iloc[:,3:6].mean(axis=1)
df

   Roll numbers     Name Gender  Marks1  Marks2  Marks3  Total    Average
0             1   Shweta      F      91      87      94    272  90.666667
1             2     Roha      F      98      55      77    230  76.666667
2             3    Naina      F      78      74      60    212  70.666667
3             4    Vansh      M      65      68      58    191  63.666667
4             5     Puja      F      45      94      62    201  67.000000
5             6   Aniket      M      47      80      54    181  60.333333
6             7    Manik      M      89      59      82    230  76.666667
7             8   Pranay      M      92      93      64    249  83.000000
8             9     Pihu      F      72      88      72    232  77.333333
9            10  Anirudh      M      86      67      91    244  81.333333

In [15]:
max_avg = df['Average'].max()
top_student = top_student = df[df['Average'] == max_avg]

print(f"student with highest average is {top_student['Name'].values[0]}")

student with highest average is Shweta

In [25]:
#	new_df = df.loc[(df['Type 1'] == 'Grass') & (df['Type 2'] == 'Poison') & (df['HP']>70)]
#print(df)
new_df = df.loc[df['Marks2']<40]
print(new_df)

   Roll numbers     Name Gender  Marks1  Marks2  Marks3
1             2     Roha      F      98      35      77
8             9     Pihu      F      72      38      72
9            10  Anirudh      M      86      37      91

In [31]:
numeric_columns = df.select_dtypes(include=[np.number]) 
summary = numeric_columns.describe(percentiles=[0.25, 0.5, 0.75])
summary = summary.loc[['min', '25%', '50%', '75%', 'max']]
print(summary)

     Roll numbers  Marks1  Marks2  Marks3
min          1.00   27.00   35.00   54.00
25%          3.25   66.75   43.25   60.50
50%          5.50   82.00   66.00   68.00
75%          7.75   90.50   78.50   80.75
max         10.00   98.00   93.00   94.00